app/controllers/v1/assignments_controller.rb

  def show
    assignment = Assignment.find(params[:id])
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    assignment = Assignment.create!(assignment_params)
---
INSERT INTO "assignments" ("month", "rnd_percentage", "owner_type", "owner_id", "project_id") VALUES (?, ?, ?, ?, ?)  [["month", 1], ["rnd_percentage", 50.0], ["owner_type", "Employee"], ["owner_id", 1], ["project_id", 1]]

  def update
    assignment = Assignment.find(params[:id])
    assignment.update(assignment_params)
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "assignments" SET "rnd_percentage" = ?, "total" = ? WHERE "assignments"."id" = ?  [["rnd_percentage", 20.0], ["total", 1.6666666666666667], ["id", 1]]