app/controllers/v1/employees_controller.rb

SELECT "employees".* FROM "employees" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    employees = Employee.page(default_page).per(default_per_page)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    employee = Employee.find(params[:id])